БПКР/src/Documents/ОплатаПлатежнойКартой/ОплатаПлатежнойКартой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПлатежнойКартой</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.СчетНаОплатуПокупателю</basedOn>
  <registerRecords>AccumulationRegister.ОборотыПоДаннымЕдиногоНалога</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийОплатаПлатежнойКартой</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрямойКурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>EnumRef.ВидыДеятельностиЕН</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

БПКР/src/Enums/ВидыОперацийОплатаПлатежнойКартой/ВидыОперацийОплатаПлатежнойКартой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийОплатаПлатежнойКартой</name>
  <enumValues>
    <name>ОплатаПокупателя</name>
  </enumValues>
  <enumValues>
    <name>РозничнаяВыручка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПокупателю</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьКодПравовойФормы</name>
    <type>
      <types>EnumRef.КодыПравовойФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГНС</name>
    <type>
      <types>CatalogRef.ГНС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОсновногоДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРезидентства</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакСтраны</name>
    <type>
      <types>EnumRef.ПризнакиСтраны</types>
    </type>
  </attributes>
  <attributes>
    <name>СЭЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДоговора</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТабличнойЧасти</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БПКР/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставкиНДС</name>
    <type>
      <types>CatalogRef.КодыПоставокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановленСрокОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДоговора</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентовПрисоединенныеФайлы</types>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/Documents/ОплатаПлатежнойКартой/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗаполнениеДатыОплатыВыполнено; // Признак успешной записи даты оплаты

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ОбновитьКурсы();
	ЗаполнитьСписокВыбораКурсВзаиморасчетов();
	СуммаКурсовойРазницыВПроводке = ПолучитьСуммуКурсовойразницыИзПроводки();
	
	ИспользоватьДополнительныйПрефикс = ПолучитьФункциональнуюОпцию("ИспользоватьПрефиксКассыИБанковскогоСчета");
	
	// Одной строкой / Списком.
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		СтрокаТабличнойЧасти = Объект.РасшифровкаПлатежа.Добавить();
		СтрокаТабличнойЧасти.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредствПоВидуОперации(Объект.ВидОперации);
		Объект.КурсВзаиморасчетов = КурсВзаиморасчетовПоНацБанку;
		Объект.КратностьВзаиморасчетов = КратностьВзаиморасчетовПоНацБанку;
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
	Иначе
		Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	УстановитьФункциональныеОпцииФормы();	
	БухгалтерскийУчетКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаДополнительно, Объект.Комментарий);

	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыВыбора();
	
	// Одной строкой / Списком.
	КоличествоСтрок = Объект.РасшифровкаПлатежа.Количество();
	Элементы.РедактироватьСписком.Пометка = КоличествоСтрок > 1;
	УстановитьВозможностьРедактированияСпискомФрагмент();

	ОбновитьПодвалФормы();
	СформироватьНадписьКурсоваяРазница();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменений
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменений
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаполнениеДатыОплатыВыполнено" Тогда
		ЗаполнениеДатыОплатыВыполнено = Истина;
	ИначеЕсли ИмяСобытия = "Запись_КурсыВалют" Тогда 
		ОбновитьКурсы();
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписиНаСервере.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	
	СуммаКурсовойРазницыВПроводке = ПолучитьСуммуКурсовойразницыИзПроводки();
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец РаботаСФормами
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчета.ПослеЗаписиНаСервере(ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнениеДатыОплатыВыполнено = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", Объект.Дата);
	СтруктураПараметров.Вставить("ДокументОснование", Объект.ДокументОснование);
	Оповестить("Запись_ОплатаПлатежнойКартой", СтруктураПараметров, ЭтотОбъект);
	
	// Если форма документа "Счет на оплату" закрыта, то запишем дату оплаты самостоятельно.
	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
		И Не ЗаполнениеДатыОплатыВыполнено Тогда
		ЗаписатьДатуОплаты(СтруктураПараметров);
	КонецЕсли;
	
	СформироватьНадписьКурсоваяРазница();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
		
		УстановитьФункциональныеОпцииФормы();
		
		ОбновитьКурсы();
		ЗаполнитьСписокВыбораКурсВзаиморасчетов();

		Если НЕ (Объект.ВалютаРасчетов = ВалютаРегламентированногоУчета
			И Объект.ВалютаДокумента = ВалютаРегламентированногоУчета) Тогда 
			ТекстСообщение = НСтр("ru = 'Изменилась дата документа.
					|Возможно, необходимо обновить курсы и пересчитать сумму документа.'") + Символы.ПС + Символы.ПС;
			ТекстСообщение = ТекстСообщение + НСтр("ru = 'Пересчитать документ?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросДатаПриИзменении", ЭтотОбъект), ТекстСообщение, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;	
	КонецЕсли;
	
	СформироватьНадписьКурсоваяРазница();
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер = "";
	Объект.БанковскийСчет = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьОсновнойБанковскийСчетОрганизации(Объект.Организация);
	ОбработатьИзменениеБанковскогоСчетаОрганизации();
	УстановитьФункциональныеОпцииФормы();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("УстановитьПиктограммуКомментария", 0.1, Истина);
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Вид операции.
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ОбновитьРеквизиты();
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
	УстановитьПараметрыВыбора();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Контрагент.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении();
	
	Объект.ДоговорКонтрагента = СтруктураДанные.ДоговорКонтрагента;
	ОбработатьИзменениеДоговора();
	
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Договор контрагента.
//
&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ОбработатьИзменениеДоговора();
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Банковский счет организации.
//
&НаКлиенте
Процедура БанковскийСчетОрганизацииПриИзменении(Элемент)
	ОбработатьИзменениеБанковскогоСчетаОрганизации();
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода КурсВзаиморасчетов.
//
&НаКлиенте
Процедура КурсВзаиморасчетовПриИзменении(Элемент)
	
	//Если Объект.КурсВзаиморасчетов = 0 Тогда
	//	Объект.КурсВзаиморасчетов = КурсВзаиморасчетовПоНацБанку;	
	//КонецЕсли;	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
	ДанныеДокумента.Вставить("Курс", 		Курс);
	ДанныеДокумента.Вставить("Кратность", 	Кратность);
	ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
	ДанныеВзаиморасчетов = ПолучитьКурсВалюты(Объект.ВалютаРасчетов, ДатаДокумента);
	
	Если (Объект.ВалютаДокумента = ВалютаРегламентированногоУчета ИЛИ ДанныеВзаиморасчетов.Валюта = ВалютаРегламентированногоУчета) И Объект.КурсВзаиморасчетов = 0 Тогда
		Объект.КурсВзаиморасчетов = КурсВзаиморасчетовПоНацБанку;
	ИначеЕсли Объект.КурсВзаиморасчетов = 0 Тогда
		УчетДенежныхСредствКлиентСервер.УстановитьКурсыВзаиморасчетов(Объект, ДанныеДокумента, ДанныеВзаиморасчетов);	
	КонецЕсли;
	
	ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
		Объект.ВалютаРасчетов, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
		
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовТабличнойЧасти(
			Объект, 
			"РасшифровкаПлатежа",
			ДанныеДокумента,
			ДанныеВзаиморасчетов,
			ВалютаРегламентированногоУчета);
	
	ОбновитьПодвалФормы();	
	СформироватьНадписьКурсоваяРазница();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаВыбора поля ввода КурсВзаиморасчетов.
//
&НаКлиенте
Процедура КурсВзаиморасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("КурсРасчетовОбработкаВыбораЗавершение", ЭтотОбъект);
		ПоказатьВводДаты(ОбработчикОповещенияОЗакрытии, ДатаДокумента, НСтр("ru = 'Укажите дату курса валюты'"), ЧастиДаты.Дата);
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода КратностьВзаиморасчетов.
//
&НаКлиенте
Процедура КратностьВзаиморасчетовПриИзменении(Элемент)
	
	Если Объект.КратностьВзаиморасчетов = 0 Тогда
		Объект.КратностьВзаиморасчетов = КратностьВзаиморасчетовПоНацБанку;	
	КонецЕсли;
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
	ДанныеДокумента.Вставить("Курс", 		Курс);
	ДанныеДокумента.Вставить("Кратность", 	Кратность);
	ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
	ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
		Объект.ВалютаРасчетов, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
		
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовТабличнойЧасти(
			Объект, 
			"РасшифровкаПлатежа",
			ДанныеДокумента,
			ДанныеВзаиморасчетов,
			ВалютаРегламентированногоУчета);
	
	ОбновитьПодвалФормы();	
	СформироватьНадписьКурсоваяРазница();	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СчетРасчетов.
//
&НаКлиенте
Процедура СчетРасчетовПриИзменении(Элемент)
	СформироватьНадписьКурсоваяРазница();
КонецПроцедуры

&НаКлиенте
Процедура КурсоваяРазницаНажатие(Элемент)
	СформироватьФормуРасшифровкиКурсовойРазницы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

// Процедура - обработчик события ПередНачаломДобавления таблицы РасшифровкаПлатежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда 
		ИтогСуммаПлатежа = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") + Элемент.ТекущиеДанные.СуммаПлатежа;
		ИтогСуммаВзаиморасчетов = Объект.РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов") + Элемент.ТекущиеДанные.СуммаВзаиморасчетов; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)
	ОбновитьПодвалФормы();
	СформироватьНадписьКурсоваяРазница();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока 
		И НЕ Копирование Тогда 
		
		СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредствПоВидуОперации(Объект.ВидОперации);
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСуммаПлатежа.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
	ДанныеДокумента.Вставить("Курс", 		Курс);
	ДанныеДокумента.Вставить("Кратность", 	Кратность);
	ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
	ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
		Объект.ВалютаРасчетов, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
		
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовСтрокиТабличнойЧасти(
		СтрокаТабличнойЧасти,
		ДанныеДокумента,
		ДанныеВзаиморасчетов,
		ВалютаРегламентированногоУчета);
	
	ОбновитьПодвалФормы();
	СформироватьНадписьКурсоваяРазница();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСуммаВзаиморасчетов.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаВзаиморасчетовПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
	ДанныеДокумента.Вставить("Курс", 		Курс);
	ДанныеДокумента.Вставить("Кратность", 	Кратность);
	ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);

	ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
		Объект.ВалютаРасчетов, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
		
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьКурсВзаиморасчетовТабличнойЧасти(
		Объект,
		СтрокаТабличнойЧасти,
		ДанныеДокумента,
		ДанныеВзаиморасчетов,
		ВалютаРегламентированногоУчета);
		
	// Значения реквизитов объекта изменились, а в структуре остались старые значения.
	ДанныеВзаиморасчетов.Курс = Объект.КурсВзаиморасчетов;	
		
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовТабличнойЧасти(
			Объект, 
			"РасшифровкаПлатежа",
			ДанныеДокумента,
			ДанныеВзаиморасчетов,
			ВалютаРегламентированногоУчета);	
		
	ОбновитьПодвалФормы();
	СформироватьНадписьКурсоваяРазница();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСуммаПлатежа1.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежа1ПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
	ДанныеДокумента.Вставить("Курс", 		Курс);
	ДанныеДокумента.Вставить("Кратность", 	Кратность);
	ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
	ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
		Объект.ВалютаРасчетов, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
		
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовСтрокиТабличнойЧасти(
		СтрокаТабличнойЧасти,
		ДанныеДокумента,
		ДанныеВзаиморасчетов,
		ВалютаРегламентированногоУчета);
	
	ОбновитьПодвалФормы();
	СформироватьНадписьКурсоваяРазница();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода РасшифровкаПлатежаСуммаВзаиморасчетов1.
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаВзаиморасчетов1ПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
	ДанныеДокумента.Вставить("Курс", 		Курс);
	ДанныеДокумента.Вставить("Кратность", 	Кратность);
	ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
	ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
		Объект.ВалютаРасчетов, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
		
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьКурсВзаиморасчетовТабличнойЧасти(
		Объект,
		СтрокаТабличнойЧасти,
		ДанныеДокумента,
		ДанныеВзаиморасчетов,
		ВалютаРегламентированногоУчета);
	
	ОбновитьПодвалФормы();
	СформироватьНадписьКурсоваяРазница();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды РедактироватьСписком.
//
&НаКлиенте
Процедура РедактироватьСписком(Команда)
	
	УстановитьВозможностьРедактированияСписком();
	
КонецПроцедуры // РедактироватьСписком()

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросУстановитьВозможностьРедактированияСписком(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Элементы.РедактироватьСписком.Пометка = Истина;
        Возврат;
    КонецЕсли;
	
	КоличествоСтрок = ДополнительныеПараметры.КоличествоСтрок;
	
	// удаление строк в обратном порядке
    Пока КоличествоСтрок > 1 Цикл
        Объект.РасшифровкаПлатежа.Удалить(Объект.РасшифровкаПлатежа[КоличествоСтрок - 1]);
        КоличествоСтрок = КоличествоСтрок - 1;
    КонецЦикла;
    Элементы.РасшифровкаПлатежа.ТекущаяСтрока = Объект.РасшифровкаПлатежа[0].ПолучитьИдентификатор();
    
    УстановитьВозможностьРедактированияСпискомФрагмент();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОтветНаВопросДата.
//
&НаКлиенте
Процедура ОтветНаВопросДатаПриИзменении(Результат, ДополнительныеПараметры) Экспорт
    Ответ = Результат;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьКурсВалютыДокумента();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	Если Объект.ВидОперации = Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя
		Или Объект.ВидОперации = Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю Тогда 
		
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.СчетРасчетов.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийОплатаПлатежнойКартой.РозничнаяВыручка Тогда 
		
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СчетРасчетов.Видимость = Ложь;
	КонецЕсли;	
		
	// Расчет не в валюте договора.	
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента)
		И ЗначениеЗаполнено(Объект.ВалютаРасчетов)
		И НЕ Объект.ВалютаРасчетов = Объект.ВалютаДокумента Тогда		
		Элементы.КурсВзаиморасчетов.Видимость = Истина;		
		Элементы.КратностьВзаиморасчетов.Видимость = Истина;
		Элементы.РасшифровкаПлатежаСуммаВзаиморасчетов.Видимость = Истина;		
		Элементы.РасшифровкаПлатежаСуммаВзаиморасчетов1.Видимость = Истина;
		Элементы.ВалютаРасчетов.Видимость = Истина;
	Иначе 
		Элементы.КурсВзаиморасчетов.Видимость = Ложь;		
		Элементы.КратностьВзаиморасчетов.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаСуммаВзаиморасчетов.Видимость = Ложь;		
		Элементы.РасшифровкаПлатежаСуммаВзаиморасчетов1.Видимость = Ложь;
		Элементы.ВалютаРасчетов.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.КратностьВзаиморасчетов > 1 Тогда
		Элементы.КратностьВзаиморасчетов.Видимость = Истина;
	Иначе 
		Элементы.КратностьВзаиморасчетов.Видимость = Ложь;
	КонецЕсли;	
	
	// Список выбора курсов.
	Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета
		Или Объект.ВалютаРасчетов = ВалютаРегламентированногоУчета Тогда 
		Элементы.КурсВзаиморасчетов.КнопкаВыпадающегоСписка = Истина;
	Иначе 
		Элементы.КурсВзаиморасчетов.КнопкаВыпадающегоСписка = Ложь;
	КонецЕсли;	

КонецПроцедуры 

// Процедура устанавливает параметры выбора.
//
&НаКлиенте
Процедура УстановитьПараметрыВыбора()
	
	МассивПараметровВыбора = БухгалтерскийУчетКлиентСервер.ПолучитьМассивПараметровВыбораДоговора(Объект.Ссылка, Объект.ВидОперации);
	// Формирование параметра выбора.
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивПараметровВыбора));
	// Добавление параметра выбора.
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ДоговорКонтрагента.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры // УстановитьПараметрыВыбора()

// Процедура устанавливает функциональные опции формы документа.
//
&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма, Объект.Организация, ДатаДокумента);
КонецПроцедуры

// Функция - Статья движения денежных средств по виду операции
//
// Параметры:
//  ВидОперации	 - ПеречисленияСсылка.ВидыОперацийОплатаПлатежнойКартой	 - Вид операции документа
// 
// Возвращаемое значение:
//  СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС из параметров учета
//
&НаСервереБезКонтекста
Функция СтатьяДвиженияДенежныхСредствПоВидуОперации(ВидОперации)
	Возврат БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСтатьюДвиженияДенежныхСредствПоВидуОперации(ВидОперации);
КонецФункции 

&НаКлиенте
Процедура ОбновитьРеквизиты()

	Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Объект.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	Объект.ВалютаРасчетов = Объект.ВалютаДокумента;

	КурсВзаиморасчетовПоНацБанку = Курс;
	КратностьВзаиморасчетовПоНацБанку = Кратность;
	
	// Заполнение по умолчанию.
	ДанныеДляЗаполнения = ПолучитьДанныеДляЗаполненияПоУмолчанию(Объект.ВидОперации);
	Объект.СчетРасчетов = ДанныеДляЗаполнения.СчетРасчетов;
КонецПроцедуры // ОбновитьРеквизиты()

// Получает набор данных с сервера для процедуры ОбновитьРеквизиты.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДляЗаполненияПоУмолчанию(ВидОперации)
	
	СтруктураДанные = Новый Структура;
		
	СтруктураДанные.Вставить(
		"СчетРасчетов",
		ПланыСчетов.Хозрасчетный.ПустаяСсылка());
		
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДляЗаполненияПоУмолчанию()

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением)
	РазностьДат = БухгалтерскийУчетСервер.ПроверитьНомерДокумента(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("РазностьДат",	РазностьДат);
	
	Возврат СтруктураДанные;
КонецФункции // ПолучитьДанныеДатаПриИзменении()

// Процедура - Установить пиктограмму комментария.
//
&НаКлиенте
Процедура УстановитьПиктограммуКомментария()
	БухгалтерскийУчетКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаДополнительно, Объект.Комментарий);
КонецПроцедуры

// Процедура - устанавливает возможность редактирования списком.
//
&НаКлиенте
Процедура УстановитьВозможностьРедактированияСписком()
	
	Элементы.РедактироватьСписком.Пометка = НЕ Элементы.РедактироватьСписком.Пометка;
	
	КоличествоСтрок = Объект.РасшифровкаПлатежа.Количество();
	
	Если НЕ Элементы.РедактироватьСписком.Пометка
		И КоличествоСтрок > 1 Тогда
		  
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросУстановитьВозможностьРедактированияСписком", ЭтотОбъект, Новый Структура("КоличествоСтрок", КоличествоСтрок));
		ТекстВопроса = НСтр("ru = 'Все строки кроме первой будут удалены. Продолжить выполнение операции?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	Иначе
   		УстановитьВозможностьРедактированияСпискомФрагмент();
	КонецЕсли;
КонецПроцедуры

// Процедура - устанавливает возможность редактирования списком (продолжение).
//
&НаКлиенте
Процедура УстановитьВозможностьРедактированияСпискомФрагмент()
    Если Элементы.РедактироватьСписком.Пометка Тогда
        Элементы.СтраницыСтрокойСписком.ТекущаяСтраница = Элементы.Списком;
    Иначе
        Элементы.СтраницыСтрокойСписком.ТекущаяСтраница = Элементы.ОднаСтрока;
    КонецЕсли;
КонецПроцедуры // УстановитьВозможностьРедактированияСписком()

// Процедура - устанавливает курс документа на дату.
//
&НаСервере
Процедура УстановитьКурсВалютыДокумента()
	ВалютаДокумента = Объект.БанковскийСчет.ВалютаДенежныхСредств;
	Если ЗначениеЗаполнено(ВалютаДокумента) 
		И ЗначениеЗаполнено(Объект.ВалютаРасчетов) Тогда
		
		ДанныеДокумента = Новый Структура();
		ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
		ДанныеДокумента.Вставить("Курс", 		Курс);
		ДанныеДокумента.Вставить("Кратность", 	Кратность);
		ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
		ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
			Объект.ВалютаРасчетов, КурсВзаиморасчетовПоНацБанку, КратностьВзаиморасчетовПоНацБанку);
			
		УчетДенежныхСредствКлиентСервер.УстановитьКурсыВзаиморасчетов(Объект, ДанныеДокумента, ДанныеВзаиморасчетов);
			
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовТабличнойЧасти(
			Объект, 
			"РасшифровкаПлатежа",
			ДанныеДокумента,
			ДанныеВзаиморасчетов,
			ВалютаРегламентированногоУчета);
	КонецЕсли;
КонецПроцедуры // УстановитьКурсВалютыДокумента()

// Получает набор данных с сервера для процедуры КонтрагентПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении()
	
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация, Объект.ВидОперации);
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ДоговорКонтрагента",
		ДоговорПоУмолчанию);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеКонтрагентПриИзменении()

// Получает договор по умолчанию.
//
&НаСервереБезКонтекста
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация, ВидОперации)
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	СписокВидовДоговоров = МенеджерСправочника.ВидыДоговораДляДокумента(Документ, ВидОперации);
	ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеДоговора()
	
	СтруктураДанные = ПолучитьДанныеДоговорПриИзменении(ДатаДокумента, Объект.ДоговорКонтрагента, Объект.ВидОперации);

	// Обработка изменения валюты.
	СтруктураКурсыПред = Новый Структура("Валюта", Объект.ВалютаРасчетов);
	Объект.ВалютаРасчетов = СтруктураДанные.ВалютаРасчетов;
	КурсВзаиморасчетовПоНацБанку = СтруктураДанные.ВалютаРасчетовКурсКратность.Курс;
	КратностьВзаиморасчетовПоНацБанку = СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность;
	СтруктураКурсы = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаРасчетов, КурсВзаиморасчетовПоНацБанку, КратностьВзаиморасчетовПоНацБанку);
	
	// Обработка изменения отражения в учете.
	Объект.СчетРасчетов = СтруктураДанные.СчетРасчетов;	
		
	// Вопрос изменения
	ИзмениласьВалютаРасчетов = СтруктураКурсыПред.Валюта <> СтруктураДанные.ВалютаРасчетов
		И ЗначениеЗаполнено(Объект.ВалютаРасчетов); 
	ПересчетНеобходим = (Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") > 0);	
	
	// Обновление курса взаиморасчетов.
	Если ИзмениласьВалютаРасчетов Тогда 
		ЗаполнитьСписокВыбораКурсВзаиморасчетов();

		ДанныеДокумента = Новый Структура();
		ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
		ДанныеДокумента.Вставить("Курс", 		Курс);
		ДанныеДокумента.Вставить("Кратность", 	Кратность);
		ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
		УчетДенежныхСредствКлиентСервер.УстановитьКурсыВзаиморасчетов(Объект,ДанныеДокумента, СтруктураКурсы);
	КонецЕсли;	
	
	// Пересчет суммы взаиморасчетов.
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента)
		И ИзмениласьВалютаРасчетов
		И ПересчетНеобходим Тогда
		
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовТабличнойЧасти(
			Объект, "РасшифровкаПлатежа", ДанныеДокумента, СтруктураКурсы, ВалютаРегламентированногоУчета);
			
		ОбновитьПодвалФормы();
		СформироватьНадписьКурсоваяРазница();
	КонецЕсли;	
КонецПроцедуры

// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДоговорПриИзменении(Период, ДоговорКонтрагента, ВидОперации)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		ДоговорКонтрагента.ВалютаРасчетов);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаРасчетов, Период));
	
	СчетаУчета = БухгалтерскийУчетВызовСервера.ПолучитьСчетаРасчетовСКонтрагентом(ДоговорКонтрагента.Организация, ДоговорКонтрагента.Владелец, ДоговорКонтрагента);
	Если ВидОперации = Перечисления.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя
		Или ВидОперации = Перечисления.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю Тогда 
		СтруктураДанные.Вставить(
			"СчетРасчетов",
			СчетаУчета.СчетАвансовПокупателя);
	Иначе 	
		СтруктураДанные.Вставить(
			"СчетРасчетов",
			ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДоговорПриИзменении()

&НаКлиенте
Процедура ОбработатьИзменениеБанковскогоСчетаОрганизации()
	
	СтруктураДанные = ПолучитьДанныеБанковскийСчетПриИзменении(ДатаДокумента, Объект.БанковскийСчет);

	// Очистка номера документа
	Если ИспользоватьДополнительныйПрефикс Тогда
		Объект.Номер = "";
	КонецЕсли;

	// Обработка изменения валюты.
	Объект.ВалютаДокумента = СтруктураДанные.ВалютаДокумента;
	Курс = СтруктураДанные.ВалютаДокументаКурсКратность.Курс;
	Кратность = СтруктураДанные.ВалютаДокументаКурсКратность.Кратность;
	
	СтруктураКурсы = Новый Структура("Валюта, Курс, Кратность, ПрямойКурс", Объект.ВалютаДокумента, Курс, Кратность, Объект.ПрямойКурс);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаПлатежнойКартой.РозничнаяВыручка") Тогда 
		Объект.ВалютаРасчетов = Объект.ВалютаДокумента;
	КонецЕсли;	
	
	// Вопрос изменения
	//ИзмениласьВалютаРасчетов = СтруктураКурсыПред.Валюта <> СтруктураДанные.ВалютаДокумента
	//	И ЗначениеЗаполнено(Объект.ВалютаДокумента); 
	//ПересчетНеобходим = (Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") > 0);	
	ИзмениласьВалютаРасчетов = Истина;
	ПересчетНеобходим = Истина;
	
	// Обновление курса взаиморасчетов.
	Если ИзмениласьВалютаРасчетов Тогда
		ЗаполнитьСписокВыбораКурсВзаиморасчетов();

		ДанныеВзаиморасчетов = ПолучитьКурсВалюты(Объект.ВалютаРасчетов, ДатаДокумента);
		
		УчетДенежныхСредствКлиентСервер.УстановитьКурсыВзаиморасчетов(Объект, СтруктураКурсы, ДанныеВзаиморасчетов);
	КонецЕсли;	

	Если ИзмениласьВалютаРасчетов
		И ПересчетНеобходим Тогда
		
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовТабличнойЧасти(
			Объект, "РасшифровкаПлатежа", СтруктураКурсы, ДанныеВзаиморасчетов, ВалютаРегламентированногоУчета);
			
		ОбновитьПодвалФормы();
		СформироватьНадписьКурсоваяРазница();
	КонецЕсли;		
КонецПроцедуры

// Получает набор данных с сервера для процедуры БанковскийСчетОрганизацииПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеБанковскийСчетПриИзменении(Период, БанковскийСчет)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ВалютаДокумента",
		БанковскийСчет.ВалютаДенежныхСредств);
		
	СтруктураДанные.Вставить(
		"ВалютаДокументаКурсКратность",
		РаботаСКурсамиВалют.ПолучитьКурсВалюты(БанковскийСчет.ВалютаДенежныхСредств, Период));
		
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеБанковскийСчетПриИзменении()

// Процедура рассчитывает итоги для подвала формы.
//
&НаКлиенте
Процедура ОбновитьПодвалФормы()
	ИтогСуммаПлатежа = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ИтогСуммаВзаиморасчетов = Объект.РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов"); 
КонецПроцедуры // ОбновитьПодвалФормы()

// Процедура обновляет курсы валют
//
&НаСервере
Процедура ОбновитьКурсы()

	// Курсы по валюте документа.
	ВалютаДокументаКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ДатаДокумента);
	Курс = ВалютаДокументаКурсКратность.Курс;
	Кратность = ВалютаДокументаКурсКратность.Кратность;
	
	Если Курс = 0 
		Или Кратность = 0 Тогда 
		Курс = 1;
		Кратность = 1;
	КонецЕсли;	
	
	// Курсы взаиморасчетов.
	ВалютаРасчетовКурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаРасчетов, ДатаДокумента);
	КурсВзаиморасчетовПоНацБанку = ВалютаРасчетовКурсКратность.Курс;
	КратностьВзаиморасчетовПоНацБанку = ВалютаРасчетовКурсКратность.Кратность;

	Если КурсВзаиморасчетовПоНацБанку = 0 
		Или КратностьВзаиморасчетовПоНацБанку = 0 Тогда 
		КурсВзаиморасчетовПоНацБанку = 1;
		КратностьВзаиморасчетовПоНацБанку = 1;
	КонецЕсли;	
	
КонецПроцедуры 

// Процедура заполняет список выбора курса взаиморасчетов.
//
&НаСервере
Процедура ЗаполнитьСписокВыбораКурсВзаиморасчетов()

	Элементы.КурсВзаиморасчетов.СписокВыбора.Очистить();
	СписокКурсовВалют = КурсыВалют();
	
	Для Каждого КурсНаДату Из СписокКурсовВалют Цикл
		Элементы.КурсВзаиморасчетов.СписокВыбора.Добавить(КурсНаДату.Значение, КурсНаДату.Представление);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСписокВыбораКурсВзаиморасчетов()

// Получает список курсов валют для списка выбора.
// 
// Возвращаемое значение:
//  СписокКурсовВалют - СписокЗначений
//
&НаСервере
Функция КурсыВалют()
	
	СписокКурсовВалют = Новый СписокЗначений;
	
	Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
		КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаРасчетов, ДатаДокумента);
	Иначе
		КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ДатаДокумента);
	КонецЕсли;	
	ШаблонСтроки = НСтр("ru = '%1 (на %2)'");
	СписокКурсовВалют.Добавить(КурсНаДату.Курс, СтрШаблон(ШаблонСтроки, Строка(КурсНаДату.Курс), Формат(ДатаДокумента, "ДФ = дд.ММ.гг")));
	Для ДеньМинус = 1 По 5 Цикл
		ДатаКурса = ДатаДокумента - (ДеньМинус * 86400);
		Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
			КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаРасчетов, ДатаКурса);
		Иначе
			КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ДатаКурса);
		КонецЕсли;
		СписокКурсовВалют.Добавить(КурсНаДату.Курс, СтрШаблон(ШаблонСтроки, Строка(КурсНаДату.Курс), Формат(ДатаКурса, "ДФ = дд.ММ.гг")));
	КонецЦикла;
	
	СписокКурсовВалют.Добавить(0, НСтр("ru = '<Выбрать другую дату>'"));

	Возврат СписокКурсовВалют;
КонецФункции	

&НаКлиенте
Процедура КурсРасчетовОбработкаВыбораЗавершение(ДатаКурса, ДополнительныеПараметры) Экспорт
	Если ДатаКурса <> Неопределено Тогда
		КурсРасчетовОбработкаВыбораНаСервере(ДатаКурса);
		
		ДанныеДокумента = Новый Структура();
		ДанныеДокумента.Вставить("Валюта", 		Объект.ВалютаДокумента);
		ДанныеДокумента.Вставить("Курс", 		Курс);
		ДанныеДокумента.Вставить("Кратность", 	Кратность);
		ДанныеДокумента.Вставить("ПрямойКурс", 	Объект.ПрямойКурс);
	
		ДанныеВзаиморасчетов = Новый Структура("Валюта, Курс, Кратность", 
			Объект.ВалютаРасчетов, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
			
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуВзаиморасчетовТабличнойЧасти(
				Объект, 
				"РасшифровкаПлатежа",
				ДанныеДокумента,
				ДанныеВзаиморасчетов,
				ВалютаРегламентированногоУчета);
		
		ОбновитьПодвалФормы();	
		СформироватьНадписьКурсоваяРазница();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КурсРасчетовОбработкаВыбораНаСервере(ДатаКурса)
	
	Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
		КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаРасчетов, ДатаКурса);
	Иначе
		КурсНаДату = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ДатаКурса);
	КонецЕсли;
	
	Объект.КурсВзаиморасчетов = ?(КурсНаДату.Курс = 0, 1, КурсНаДату.Курс);
	Объект.КратностьВзаиморасчетов = ?(КурсНаДату.Кратность = 0, 1, КурсНаДату.Кратность);	
КонецПроцедуры

// См. РаботаСКурсамиВалют.ПолучитьКурсВалюты.
&НаСервереБезКонтекста
Функция ПолучитьКурсВалюты(Валюта, ДатаДокумента)
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаДокумента);
КонецФункции // ПолучитьКурсВалюты()

// Формирует надпись курсовая разница
//
&НаКлиенте
Процедура СформироватьНадписьКурсоваяРазница()
	
	Если Объект.ВалютаДокумента = Объект.ВалютаРасчетов Тогда 
		Элементы.КурсоваяРазница.Заголовок = "";
		Возврат;
	КонецЕсли;	

	СуммаПлатежа 		= Окр(Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") * Курс / Кратность, 2);
	СуммаВзаиморасчетов = Окр(Объект.РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов") * КурсВзаиморасчетовПоНацБанку / КратностьВзаиморасчетовПоНацБанку, 2);	
	
	ДанныеОСчетах = ПолучитьДанныеОСчетах(Объект.БанковскийСчет, Объект.СчетРасчетов);

	СуммаКурсовойРазницы = СуммаПлатежа - СуммаВзаиморасчетов;
	Если Объект.КурсВзаиморасчетов = КурсВзаиморасчетовПоНацБанку Тогда
		СуммаКурсовойРазницы = 0;
	КонецЕсли;
	
	// Нет курсовой разницы
	Если СуммаКурсовойРазницы = 0 Тогда 
		Текст1 = "";	
		
	// Расход валюты, убыток
	ИначеЕсли НЕ ДанныеОСчетах.СчетПриходаВалютный И ДанныеОСчетах.СчетРасходовВалютый И СуммаКурсовойРазницы < 0 Тогда
		Текст1 = "Убыток";
		
	// Расход валюты, доход		
	ИначеЕсли НЕ ДанныеОСчетах.СчетПриходаВалютный И ДанныеОСчетах.СчетРасходовВалютый И СуммаКурсовойРазницы > 0 Тогда
		Текст1 = "Доход";	
		
	// Приход валюты, убыток	
	ИначеЕсли ДанныеОСчетах.СчетПриходаВалютный И НЕ ДанныеОСчетах.СчетРасходовВалютый И СуммаКурсовойРазницы < 0 Тогда
		Текст1 = "Убыток";		
		
	// Приход валюты, доход	
	ИначеЕсли ДанныеОСчетах.СчетПриходаВалютный И НЕ ДанныеОСчетах.СчетРасходовВалютый И СуммаКурсовойРазницы > 0 Тогда
		Текст1 = "Доход";
		
	// Валюта - Валюта, убыток	
	ИначеЕсли ДанныеОСчетах.СчетПриходаВалютный И ДанныеОСчетах.СчетРасходовВалютый И СуммаКурсовойРазницы < 0 Тогда
		Текст1 = "Убыток";			
		
	// Валюта - Валюта, доход		
	ИначеЕсли ДанныеОСчетах.СчетПриходаВалютный И ДанныеОСчетах.СчетРасходовВалютый И СуммаКурсовойРазницы > 0 Тогда
		Текст1 = "Доход";			
		
	Иначе
		Текст1 = "";
	КонецЕсли;
	
	Если Текст1 = "" Тогда
		Текст2 = "";
		Элементы.КурсоваяРазница.Заголовок = "";
	Иначе
		Текст2 = СтрШаблон(НСтр("ru = '%1 - %2 = %3'"), СуммаПлатежа, СуммаВзаиморасчетов, СуммаКурсовойРазницы);
		
		СуммаКурсовойРазницы = ?(СуммаКурсовойРазницы < 0, СуммаКурсовойРазницы * -1, СуммаКурсовойРазницы);
		
		Если СуммаКурсовойРазницы = СуммаКурсовойРазницыВПроводке Тогда
			ТекстЗаголовока = СтрШаблон(НСтр("ru = 'Операционная КР: %1 %2'"), Текст1, Текст2);
		Иначе
			ТекстЗаголовока = СтрШаблон(НСтр("ru = 'Операционная КР: %1 %2 (КУРС ИЗМЕНЕН)'"), Текст1, Текст2);
		КонецЕсли;
		
		Элементы.КурсоваяРазница.Заголовок = ТекстЗаголовока; 
	КонецЕсли;	
КонецПроцедуры

// Получает набор данных с сервера для процедуры СформироватьНадписьКурсоваяРазница.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеОСчетах(БанковскийСчет, СчетРасчетов)
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"СчетПриходаВалютный",
		БанковскийСчет.СчетУчета.Валютный);
		
	СтруктураДанные.Вставить(
		"СчетРасходовВалютый",
		СчетРасчетов.Валютный);
		
	СтруктураДанные.Вставить(
		"СчетУчета",
		БанковскийСчет.СчетУчета);
		
	Возврат СтруктураДанные;	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДатуОплаты(СтруктураПараметров)
	
	ДокументОснованиеОбъект = СтруктураПараметров.ДокументОснование.ПолучитьОбъект();
	ДокументОснованиеУспешноЗаблокирован = Истина;
	
	Попытка
		ДокументОснованиеОбъект.Заблокировать();
	Исключение
		ДокументОснованиеУспешноЗаблокирован = Ложь;
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось заблокировать %1: %2, для заполнения даты оплаты, по причине:
				|%3'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				СтруктураПараметров.ДокументОснование, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Предупреждение,, ДокументОснованиеОбъект, ОписаниеОшибки());
	КонецПопытки;
	
	// Если удалось заблокировать, заполним дату оплаты.
	Если ДокументОснованиеУспешноЗаблокирован Тогда
		ДокументОснованиеОбъект.ДатаОплаты = СтруктураПараметров.Дата;
		ДокументОснованиеОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуКурсовойразницыИзПроводки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&Период,
		|			&Период,
		|			Авто,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыОтОперационныхКурсовыхРазниц)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтОперационныхКурсовыхРазниц),
		|			,
		|			,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.Регистратор = &Регистратор";	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Сумма;
	Иначе	
		Возврат 0;	
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура СформироватьФормуРасшифровкиКурсовойРазницы()
	ДанныеОСчетах = ПолучитьДанныеОСчетах(Объект.БанковскийСчет, Объект.СчетРасчетов);
	
	ВалютаРасчетовОКР = ?(Объект.ВалютаРасчетов = ВалютаРегламентированногоУчета, Объект.ВалютаДокумента, Объект.ВалютаРасчетов);
		
	КурсКратностьВалютыРасчетов = ПолучитьКурсВалюты(ВалютаРасчетовОКР, ДатаДокумента);
	КурсКратностьВалютыДокумента = ПолучитьКурсВалюты(Объект.ВалютаДокумента, ДатаДокумента);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПриходДенежныхСредств", 			ИСТИНА);
	СтруктураПараметров.Вставить("СчетРасчетов",						Объект.СчетРасчетов);
	СтруктураПараметров.Вставить("КассаБанковскийСчет",					Объект.БанковскийСчет);
	СтруктураПараметров.Вставить("ДенежныйСчет",						ДанныеОСчетах.СчетУчета);
	СтруктураПараметров.Вставить("ВалютаДокумента",						Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета",		ВалютаРегламентированногоУчета);
	СтруктураПараметров.Вставить("ВалютаРасчетов",						Объект.ВалютаРасчетов);
	СтруктураПараметров.Вставить("КурсДокумента",						?(ЗначениеЗаполнено(КурсКратностьВалютыДокумента.Курс), КурсКратностьВалютыДокумента.Курс, 1));
	СтруктураПараметров.Вставить("КратностьДокумента",					?(ЗначениеЗаполнено(КурсКратностьВалютыДокумента.Кратность), КурсКратностьВалютыДокумента.Кратность, 1));
	СтруктураПараметров.Вставить("СуммаПлатежа",						ИтогСуммаПлатежа);
	СтруктураПараметров.Вставить("СуммаВзаиморасчетов",					ИтогСуммаВзаиморасчетов);
	СтруктураПараметров.Вставить("КурсВзаиморасчетовПоНацБанку",		?(ЗначениеЗаполнено(КурсКратностьВалютыРасчетов.Курс), КурсКратностьВалютыРасчетов.Курс, 1));
	СтруктураПараметров.Вставить("КратностьВзаиморасчетовПоНацБанку",	?(ЗначениеЗаполнено(КурсКратностьВалютыРасчетов.Кратность), КурсКратностьВалютыРасчетов.Кратность, 1));
	
	ОткрытьФорму("ОбщаяФорма.ФормаРасшифровкаКурсовойРазницы", СтруктураПараметров, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры // СформироватьФормуРасшифровкиКурсовойРазницы()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
     ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
     ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
 
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
     ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
     ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
